Tekla Open API Reference for Tekla Structures 2025
Distance.GetHashCode Method
 Returns the hash code for the current instance.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A 32-bit signed integer that is the hash code for the current instance.
See Also
Reference
Distance Structure
Tekla.Structures.Datatype Namespace